; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-2-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s1)
	(at package2 s1)
	(at package3 s2)
	(at package4 s1)
	(at package5 s2)
	(at package6 s0)
	(at package7 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 2)
	(= (time-to-drive s1 s0) 2)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 45)
	(= (time-to-drive s2 s0) 45)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 2)
	(= (time-to-drive s2 s1) 2)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s2)
	(at truck1 s0)
	(at truck2 s2)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s0)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 12
2. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   goals met: 5 of 12
3. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 12
4. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   goals met: 5 of 12
5. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 495
   goals met: 6 of 12
6. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 12
7. (load-truck package6 truck1 s0)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 12
8. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 495 to 517
   goals met: 6 of 12
9. (unload-truck package6 truck1 s1)
   deleted: (in package6 truck1)
   added: (at package6 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 12
10. (load-truck package4 truck1 s1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 12
11. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 517 to 539
   goals met: 8 of 12
12. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 12
13. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 9 of 12
14. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 9 of 12
15. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 539 to 559
   goals met: 9 of 12
16. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 9 of 12
17. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 559 to 581
   goals met: 9 of 12
18. (unload-truck package7 truck2 s0)
   deleted: (in package7 truck2)
   added: (at package7 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 10 of 12
19. (drive-truck truck2 s0 s2 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 581 to 1031
   goals met: 11 of 12
20. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 12 of 12
